STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
#if (CFG_LCD_SUPPORTED == 1)
          Menu_SetConnectingPage();
#endif /* (CFG_LCD_SUPPORTED == 1) */

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        case HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE:
        {
            hci_le_cis_established_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;

        case HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE:
        {
            hci_le_cis_established_v2_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_v2_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;

        case HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE:
        {
          hci_le_remote_connection_parameter_request_event_rp0 *req_event = (hci_le_remote_connection_parameter_request_event_rp0 *)p_meta_evt->data;
          hci_le_remote_connection_parameter_request_reply(req_event->Connection_Handle,
                                                         req_event->Interval_Min,
                                                         req_event->Interval_Max,
                                                         req_event->Max_Latency,
                                                         req_event->Timeout,
                                                         0,
                                                         0);
          break; /* HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE */
        }

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
        case HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_transfer_received_event_rp0 *past_received_event =
          (hci_le_periodic_advertising_sync_transfer_received_event_rp0 *) p_meta_evt->data;
          LOG_INFO_APP(">>== HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_SUBEVT_CODE - ACL Connection handle: 0x%04X  - Status 0x%02X\n",
                       past_received_event->Connection_Handle,
                       past_received_event->Status);
          if (past_received_event->Status == BLE_STATUS_SUCCESS)
          {
            TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_SYNCHRONIZED;
          }
        }
        break;
#endif /* ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) */

        /* USER CODE END SUBEVENT */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled SUBEVENT with opcode: 0x%02X\n", p_meta_evt->subevent);
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */
        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
        {
          uint8_t confirm_value;
          aci_gap_numeric_comparison_value_event_rp0 *p_numeric_comparison;
          p_numeric_comparison = (aci_gap_numeric_comparison_value_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          LOG_INFO_APP("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          LOG_INFO_APP("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);

          /* Set confirm value to 1(YES) */
          confirm_value = 1;

