STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
          ret = aci_gatt_confirm_indication(p_indication->Connection_Handle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            /* Impossible to confirm indication due to GATT process ongoing. Notify tmap_app */
            TMAPAPP_ConfirmIndicationRequired(p_indication->Connection_Handle);
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          break;
        }
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
        {
          aci_l2cap_connection_update_req_event_rp0 *p_conn_update;
          p_conn_update = (aci_l2cap_connection_update_req_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE\n");
          LOG_INFO_APP(">>== Connection_Handle : 0x%04X\n", p_conn_update->Connection_Handle);
          LOG_INFO_APP(">>== Interval_Min : 0x%04X\n", p_conn_update->Interval_Min);
          LOG_INFO_APP(">>== Interval_Max : 0x%04X\n", p_conn_update->Interval_Max);
          LOG_INFO_APP(">>== Latency : 0x%04X\n", p_conn_update->Latency);
          LOG_INFO_APP(">>== Timeout_Multiplier : 0x%04X\n", p_conn_update->Timeout_Multiplier);
          LOG_INFO_APP(">>== Identifier : 0x%02X\n", p_conn_update->Identifier);
          aci_l2cap_connection_parameter_update_resp(p_conn_update->Connection_Handle,
                                                     p_conn_update->Interval_Min,
                                                     p_conn_update->Interval_Max,
                                                     p_conn_update->Latency,
                                                     p_conn_update->Timeout_Multiplier,
                                                     0x00,
                                                     0x00,
                                                     p_conn_update->Identifier,
                                                     0x00);
          break;
        }

#if ((CFG_BLE_OPTIONS & BLE_OPTIONS_ENHANCED_ATT) == BLE_OPTIONS_ENHANCED_ATT)
        case ACI_L2CAP_COC_CONNECT_VSEVT_CODE:
        {
          aci_l2cap_coc_connect_event_rp0 *p_coc_connect;
          tBleStatus ret;
          uint16_t Result = 0x0001;
          uint8_t Channel_Number;
          uint8_t Channel_Index_List[5u];
          p_coc_connect = (aci_l2cap_coc_connect_event_rp0*)p_blecore_evt->data;
          uint8_t Max_Channel_Number = p_coc_connect->Channel_Number;
          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_VSEVT_CODE\n");
          LOG_INFO_APP(">>==  Credit Based Connection Request :\n");
          LOG_INFO_APP("         Connection_Handle : 0x%04X\n", p_coc_connect->Connection_Handle);
          LOG_INFO_APP("         SPSM : 0x%04X\n", p_coc_connect->SPSM);
          LOG_INFO_APP("         MTU : %d\n", p_coc_connect->MTU);
          LOG_INFO_APP("         MPS : %d\n", p_coc_connect->MPS);
          LOG_INFO_APP("         Initial_Credits : %d\n", p_coc_connect->Initial_Credits);
          LOG_INFO_APP("         Channel_Number : %d\n", p_coc_connect->Channel_Number);
          if (p_coc_connect->SPSM == 0x0027)
          {
            Result = 0x0000u;
          }
          if (Max_Channel_Number > (CFG_BLE_EATT_BEARER_PER_LINK - MAX_NUM_CLIENT_EATT_BEARERS))
          {
            Max_Channel_Number = (CFG_BLE_EATT_BEARER_PER_LINK - MAX_NUM_CLIENT_EATT_BEARERS);
          }
          if (Max_Channel_Number == 0)
          {
            Result = 0x00004u; /*Some connections refused - insufficient resources available*/
          }
          ret = aci_l2cap_coc_connect_confirm(p_coc_connect->Connection_Handle,
                                              CFG_BLE_EATT_MTU_MAX,
                                              CFG_BLE_COC_MPS_MAX,
                                              INITIAL_RX_CREDITS,
                                              Result,
                                              Max_Channel_Number,
                                              &Channel_Number,
                                              Channel_Index_List);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_l2cap_coc_connect_confirm() : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_l2cap_coc_connect_confirm() : Success\n");
            if (Result == 0x000u)
            {
              LOG_INFO_APP("         Number of created channels issued from remote request : %d\n", p_coc_connect->Channel_Number);
              for (uint8_t i = 0u; i < Channel_Number ; i++)
              {
                LOG_INFO_APP("            Channel_Index : 0x%04X\n", Channel_Index_List[i]);
              }
            }
          }
          break;
        }

        case ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE:
        {
#if (CFG_LOG_SUPPORTED != 0)
          aci_l2cap_coc_disconnect_event_rp0 *coc_disconnect_event;
          coc_disconnect_event = (aci_l2cap_coc_disconnect_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE\n");
          LOG_INFO_APP(">>==  Credit Based Connection Disconnected :\n");
          LOG_INFO_APP("         COC ConnHandle = 0x%04X\n",(GATT_EAB_PREFIX << 8) | coc_disconnect_event->Channel_Index);
          LOG_INFO_APP("         Channel_Index = 0x%04X\n",coc_disconnect_event->Channel_Index );
          break;
#endif /*(CFG_LOG_SUPPORTED != 0)*/
        }

        case ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE:
        {
#if (CFG_LOG_SUPPORTED != 0)
          aci_l2cap_command_reject_event_rp0 *aci_l2cap_command_reject_event;
          aci_l2cap_command_reject_event = (aci_l2cap_command_reject_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE\n");
          LOG_INFO_APP("         Reason = 0x%04X\n",aci_l2cap_command_reject_event->Reason);
          LOG_INFO_APP("         Connection Handle = 0x%04X\n",aci_l2cap_command_reject_event->Connection_Handle);
          LOG_INFO_APP("         Identifier = %d\n",aci_l2cap_command_reject_event->Identifier);
          break;
#endif /*(CFG_LOG_SUPPORTED != 0)*/
        }

        case ACI_GATT_EATT_BEARER_VSEVT_CODE:
        {
          aci_gatt_eatt_bearer_event_rp0 *eatt_bearer_event;
          eatt_bearer_event = (aci_gatt_eatt_bearer_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GATT_EATT_BEARER_VSEVT_CODE\n");
          LOG_INFO_APP("EATT Bearer associated to :\n");
          LOG_INFO_APP("        Channel_Handle = 0x%04X\n",eatt_bearer_event->Connection_Handle );
          LOG_INFO_APP("        Channel_Index = 0x%02X\n",eatt_bearer_event->Channel_Index );
          LOG_INFO_APP("        State = 0x%02X\n",eatt_bearer_event->EAB_State );
          LOG_INFO_APP("        MTU = %d\n",eatt_bearer_event->MTU );
          LOG_INFO_APP("        COC ConnHandle = 0x%04X\n",(GATT_EAB_PREFIX << 8) | eatt_bearer_event->Channel_Index);
          if (eatt_bearer_event->EAB_State == 0u)
          {
            uint8_t aChannel_Index[1];
            aChannel_Index[0] = eatt_bearer_event->Channel_Index;
            tBleStatus status = BLE_AUDIO_STACK_EATT_SubscribeBearers(aChannel_Index,1);
            LOG_INFO_APP("BLE_AUDIO_STACK_EATT_SubscribeBearers() for ChannelIdx 0x%02X returns status 0x%02X\n",
                         eatt_bearer_event->Channel_Index,
                         status);
          }
          break;
        }
#endif /*((CFG_BLE_OPTIONS & BLE_OPTIONS_ENHANCED_ATT) == BLE_OPTIONS_ENHANCED_ATT)*/

