STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
#if (CFG_LOG_SUPPORTED != 0)
    status =
#endif /*(CFG_LOG_SUPPORTED != 0)*/
    BLE_AUDIO_STACK_DB_AddRecord(GATTSERVICE_NVM_TYPE,
                                 type,
                                 addr,
                                 temp_database,
                                 GATTSERVICE_GATT_DATABASE_SIZE);
    LOG_INFO_APP("BLE_AUDIO_STACK_DB_AddRecord() for GATT Service returns status 0x%02X\n",status);
  }
}

static void GATTService_RestoreDatabase(BleConn_t *pConn)
{
  uint8_t type;
  uint8_t addr[6u];
  uint16_t data_len = 0;
  uint8_t temp_database[GATTSERVICE_GATT_DATABASE_SIZE] = {0};

  if (aci_gap_check_bonded_device(pConn->RemoteAddressType,
                                  &pConn->aRemoteAddress[0],
                                  &type,
                                  addr) == BLE_STATUS_SUCCESS)
  {
    if (BLE_AUDIO_STACK_DB_GetRecord(GATTSERVICE_NVM_TYPE,
                                        type,
                                        addr,
                                        temp_database,
                                        GATTSERVICE_GATT_DATABASE_SIZE,
                                        &data_len) == BLE_STATUS_SUCCESS)
    {
      pConn->GattService.StartHandle = temp_database[0] + (temp_database[1] << 8);
      pConn->GattService.EndHandle = temp_database[2] + (temp_database[3] << 8);
      pConn->GattService.ServiceChangedCharHandle = temp_database[4] + (temp_database[5] << 8);
      pConn->GattService.ServiceChangedCharDescHandle = temp_database[6] + (temp_database[7] << 8);

      LOG_INFO_APP("Restored GATT Service\n");
      LOG_INFO_APP("StartHandle=%04d\n", pConn->GattService.StartHandle);
      LOG_INFO_APP("EndHandle=%04d\n", pConn->GattService.EndHandle);
      LOG_INFO_APP("ServiceChangedCharHandle=%04d\n", pConn->GattService.ServiceChangedCharHandle);
      LOG_INFO_APP("ServiceChangedCharDescHandle=%04d\n", pConn->GattService.ServiceChangedCharDescHandle);

      pConn->GattService.LinkupState = GATT_SERVICE_LINKUP_COMPLETE;
    }
  }
}

static char Hex_To_Char(uint8_t Hex)
{
  if (Hex < 0xA)
  {
    return (char) Hex + 48;
  }
  else
  {
    return (char) Hex + 55;
  }
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

void APP_NotifyToRun( void )
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_AUDIO_ID, CFG_SEQ_PRIO_0);
  /* Requires to process Host Stack because in Audio Task, some API/HCI commands
   * could be called and so require to run Host Stack
   */
  BleStackCB_Process();
}

/* USER CODE END FD_WRAP_FUNCTIONS */
